src/Enums/тм_ДоступныеМетодыОбработкиЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>тм_ДоступныеМетодыОбработкиЗапросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/тм_УправлениеМаршрутизациейСлужебный/Ext/Module.bsl
// MIT License
//
// Copyright (c) 2025 Maksim Kochemasov
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Область СлужебныеПроцедурыИФункции

// Определяет контекст обработки входящего запроса по вызванному методу HTTP
//
// Параметры:
//  ВызываемыйМетодHTTP - ПеречислениеСсылка.тм_ДоступныеМетодыОбработкиЗапросов - текущий вызываемый метод HTTP
// 
// Возвращаемое значение:
//   - ОбработкаМенеджер.<ИмяОбработки> - контекст обработки запроса
//   - Неопределено - если вызываемый метод http не поддерживается
//
Функция ПолучитьКонтекстПоМетодуВходящегоЗапроса(ВызываемыйМетодHTTP) Экспорт
	
	ДоступныеМетоды = Перечисления.тм_ДоступныеМетодыОбработкиЗапросов;
	
	ДоступныеКонтексты = Новый Соответствие;
	ДоступныеКонтексты.Вставить(ДоступныеМетоды.GET, Обработки.тм_КонтекстВыполненияМетодаGET);
	ДоступныеКонтексты.Вставить(ДоступныеМетоды.POST, Обработки.тм_КонтекстВыполненияМетодаPOST);
	ДоступныеКонтексты.Вставить(ДоступныеМетоды.PUT, Обработки.тм_КонтекстВыполненияМетодаPUT);
	ДоступныеКонтексты.Вставить(ДоступныеМетоды.PATCH, Обработки.тм_КонтекстВыполненияМетодаPATCH);
	ДоступныеКонтексты.Вставить(ДоступныеМетоды.DELETE, Обработки.тм_КонтекстВыполненияМетодаDELETE);
	
	Возврат ДоступныеКонтексты[ВызываемыйМетодHTTP];
	
КонецФункции

// Возвращает объект модуля выполнения прикладной операции внешнего сервиса
//
// Параметры:
//  ПараметрыИнициализацииМодуля - Структура:
//    * МодульAPI - ОпределяемыйТип.тм_МодульАпи - основной модуль API внешнего сервиса
//    * МодульОперации - ОпределяемыйТип.тм_МодульАпи - модуль обработки прикладной операции
//    * ДанныеАутентификации - Строка - адрес во временном хранилище с данными аутентификации
// 
// Возвращаемое значение:
//   - Произвольный - объект модуля выполнения прикладной операции
//
Функция МодульПрикладнойОперации(ПараметрыИнициализацииМодуля) Экспорт
	
	Возврат Обработки.тм_КонструкторМодулейАпиИПрикладныхОпераций
		.СобратьМодульПрикладнойОперации(ПараметрыИнициализацииМодуля);
	
КонецФункции

// Возвращает объект основного модуля API внешнего сервиса
//
// Параметры:
//  ПараметрыИнициализацииМодуля - Структура:
//    * МодульAPI - ОпределяемыйТип.тм_МодульАпи - основной модуль API внешнего сервиса
//    * ДанныеАутентификации - Строка - адрес во временном хранилище с данными аутентификации
// 
// Возвращаемое значение:
//   - Произвольный - объект основного модуля API внешнего сервиса
//
Функция ОсновнойМодульAPIВнешнегоСервиса(ПараметрыИнициализацииМодуля) Экспорт
	
	Возврат Обработки.тм_КонструкторМодулейАпиИПрикладныхОпераций
		.СобратьОсновнойМодульВзаимодействияСВнешнимСервисом(ПараметрыИнициализацииМодуля);
	
КонецФункции

#КонецОбласти
